---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetPanelScheduleType
source: html/8a9ee9e3-1d73-d65a-517a-014f43ba1b22.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetPanelScheduleType Method

Returns the panel schedule type.

## Syntax (C#)
```csharp
public PanelScheduleType GetPanelScheduleType()
```